RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*******************************************************************************
 * FTFL_FCNFG - Flash Configuration Register
 ******************************************************************************/

/*!
 * @brief FTFL_FCNFG - Flash Configuration Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register provides information on the current functional state of the
 * flash memory module. The erase control bits (ERSAREQ and ERSSUSP) have write
 * restrictions. SWAP, PFLSH, RAMRDY are read-only status bits . The unassigned bits
 * read as noted and are not writable. The reset values for the SWAP, PFLASH,
 * RAMRDY bits are determined during the reset sequence.
 */
/*!
 * @name Constants and macros for entire FTFL_FCNFG register
 */
/*@{*/
#define FTFL_RD_FCNFG(base)      (FTFL_FCNFG_REG(base))
#define FTFL_WR_FCNFG(base, value) (FTFL_FCNFG_REG(base) = (value))
#define FTFL_RMW_FCNFG(base, mask, value) (FTFL_WR_FCNFG(base, (FTFL_RD_FCNFG(base) & ~(mask)) | (value)))
#define FTFL_SET_FCNFG(base, value) (FTFL_WR_FCNFG(base, FTFL_RD_FCNFG(base) |  (value)))
#define FTFL_CLR_FCNFG(base, value) (FTFL_WR_FCNFG(base, FTFL_RD_FCNFG(base) & ~(value)))
#define FTFL_TOG_FCNFG(base, value) (FTFL_WR_FCNFG(base, FTFL_RD_FCNFG(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FTFL_FCNFG bitfields
 */

/*!
 * @name Register FTFL_FCNFG, field EEERDY[0] (RO)
 *
 * This field is reserved.
 */
/*@{*/
/*! @brief Read current value of the FTFL_FCNFG_EEERDY field. */
#define FTFL_RD_FCNFG_EEERDY(base) ((FTFL_FCNFG_REG(base) & FTFL_FCNFG_EEERDY_MASK) >> FTFL_FCNFG_EEERDY_SHIFT)
#define FTFL_BRD_FCNFG_EEERDY(base) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_EEERDY_SHIFT))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field RAMRDY[1] (RO)
 *
 * This flag indicates the current status of the programming acceleration RAM.
 * This bit should always be set.
 *
 * Values:
 * - 0b0 - Programming acceleration RAM is not available.
 * - 0b1 - Programming acceleration RAM is available.
 */
/*@{*/
/*! @brief Read current value of the FTFL_FCNFG_RAMRDY field. */
#define FTFL_RD_FCNFG_RAMRDY(base) ((FTFL_FCNFG_REG(base) & FTFL_FCNFG_RAMRDY_MASK) >> FTFL_FCNFG_RAMRDY_SHIFT)
#define FTFL_BRD_FCNFG_RAMRDY(base) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_RAMRDY_SHIFT))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field PFLSH[2] (RO)
 *
 * Values:
 * - 0b0 - Reserved
 * - 0b1 - Flash memory module configured for program flash only, without
 *     support for data flash and/or EEPROM
 */
/*@{*/
/*! @brief Read current value of the FTFL_FCNFG_PFLSH field. */
#define FTFL_RD_FCNFG_PFLSH(base) ((FTFL_FCNFG_REG(base) & FTFL_FCNFG_PFLSH_MASK) >> FTFL_FCNFG_PFLSH_SHIFT)
#define FTFL_BRD_FCNFG_PFLSH(base) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_PFLSH_SHIFT))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field SWAP[3] (RO)
 *
 * For program flash only configurations, the SWAP flag indicates which physical
 * program flash block is located at relative address 0x0000. The state of the
 * SWAP flag is set by the flash memory module during the reset sequence. See the
 * Swap Control command section for information on swap management.
 *
 * Values:
 * - 0b0 - Physical program flash 0 is located at relative address 0x0000
 * - 0b1 - If the PFLSH flag is set, physical program flash 1 is located at
 *     relative address 0x0000. If the PFLSH flag is not set, physical program flash
 *     0 is located at relative address 0x0000
 */
/*@{*/
/*! @brief Read current value of the FTFL_FCNFG_SWAP field. */
#define FTFL_RD_FCNFG_SWAP(base) ((FTFL_FCNFG_REG(base) & FTFL_FCNFG_SWAP_MASK) >> FTFL_FCNFG_SWAP_SHIFT)
#define FTFL_BRD_FCNFG_SWAP(base) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_SWAP_SHIFT))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field ERSSUSP[4] (RW)
 *
 * The ERSSUSP bit allows the user to suspend (interrupt) the Erase Flash Sector
 * command while it is executing.
 *
 * Values:
 * - 0b0 - No suspend requested
 * - 0b1 - Suspend the current Erase Flash Sector command execution.
 */
/*@{*/
/*! @brief Read current value of the FTFL_FCNFG_ERSSUSP field. */
#define FTFL_RD_FCNFG_ERSSUSP(base) ((FTFL_FCNFG_REG(base) & FTFL_FCNFG_ERSSUSP_MASK) >> FTFL_FCNFG_ERSSUSP_SHIFT)
#define FTFL_BRD_FCNFG_ERSSUSP(base) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_ERSSUSP_SHIFT))

/*! @brief Set the ERSSUSP field to a new value. */
#define FTFL_WR_FCNFG_ERSSUSP(base, value) (FTFL_RMW_FCNFG(base, FTFL_FCNFG_ERSSUSP_MASK, FTFL_FCNFG_ERSSUSP(value)))
#define FTFL_BWR_FCNFG_ERSSUSP(base, value) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_ERSSUSP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field ERSAREQ[5] (RO)
 *
 * This bit issues a request to the memory controller to execute the Erase All
 * Blocks command and release security. ERSAREQ is not directly writable but is
 * under indirect user control. Refer to the device's Chip Configuration details on
 * how to request this command. The ERSAREQ bit sets when an erase all request
 * is triggered external to the flash memory module and CCIF is set (no command is
 * currently being executed). ERSAREQ is cleared by the flash memory module when
 * the operation completes.
 *
 * Values:
 * - 0b0 - No request or request complete
 * - 0b1 - Request to: run the Erase All Blocks command, verify the erased
 *     state, program the security byte in the Flash Configuration Field to the
 *     unsecure state, and release MCU security by setting the FSEC[SEC] field to the
 *     unsecure state.
 */
/*@{*/
/*! @brief Read current value of the FTFL_FCNFG_ERSAREQ field. */
#define FTFL_RD_FCNFG_ERSAREQ(base) ((FTFL_FCNFG_REG(base) & FTFL_FCNFG_ERSAREQ_MASK) >> FTFL_FCNFG_ERSAREQ_SHIFT)
#define FTFL_BRD_FCNFG_ERSAREQ(base) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_ERSAREQ_SHIFT))
/*@}*/

/*!
 * @name Register FTFL_FCNFG, field RDCOLLIE[6] (RW)
 *
 * The RDCOLLIE bit controls interrupt generation when a flash memory read
 * collision error occurs.
 *
 * Values:
 * - 0b0 - Read collision error interrupt disabled
 * - 0b1 - Read collision error interrupt enabled. An interrupt request is
 *     generated whenever a flash memory read collision error is detected (see the
 *     description of FSTAT[RDCOLERR]).
 */
/*@{*/
/*! @brief Read current value of the FTFL_FCNFG_RDCOLLIE field. */
#define FTFL_RD_FCNFG_RDCOLLIE(base) ((FTFL_FCNFG_REG(base) & FTFL_FCNFG_RDCOLLIE_MASK) >> FTFL_FCNFG_RDCOLLIE_SHIFT)
#define FTFL_BRD_FCNFG_RDCOLLIE(base) (BITBAND_ACCESS8(&FTFL_FCNFG_REG(base), FTFL_FCNFG_RDCOLLIE_SHIFT))

