RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*******************************************************************************
 * FTFL_FPROT3 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief FTFL_FPROT3 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which logical program flash regions are protected
 * from program and erase operations. Protected flash regions cannot have their
 * content changed; that is, these regions cannot be programmed and cannot be
 * erased by any flash command. Unprotected regions can be changed by program and
 * erase operations. The four FPROT registers allow 32 protectable regions. Each bit
 * protects a 1/32 region of the program flash memory . The bitfields are
 * defined in each register as follows: Program flash protection register Program flash
 * protection bits FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8]
 * FPROT3 PROT[7:0] During the reset sequence, the FPROT registers are loaded with the
 * contents of the program flash protection bytes in the Flash Configuration
 * Field as indicated in the following table. Program flash protection register
 * Flash Configuration Field offset address FPROT0 0x0008 FPROT1 0x0009 FPROT2 0x000A
 * FPROT3 0x000B To change the program flash protection that is loaded during
 * the reset sequence, unprotect the sector of program flash memory that contains
 * the Flash Configuration Field. Then, reprogram the program flash protection
 * byte.
 */
/*!
 * @name Constants and macros for entire FTFL_FPROT3 register
 */
/*@{*/
#define FTFL_RD_FPROT3(base)     (FTFL_FPROT3_REG(base))
#define FTFL_WR_FPROT3(base, value) (FTFL_FPROT3_REG(base) = (value))
#define FTFL_RMW_FPROT3(base, mask, value) (FTFL_WR_FPROT3(base, (FTFL_RD_FPROT3(base) & ~(mask)) | (value)))
#define FTFL_SET_FPROT3(base, value) (FTFL_WR_FPROT3(base, FTFL_RD_FPROT3(base) |  (value)))
#define FTFL_CLR_FPROT3(base, value) (FTFL_WR_FPROT3(base, FTFL_RD_FPROT3(base) & ~(value)))
#define FTFL_TOG_FPROT3(base, value) (FTFL_WR_FPROT3(base, FTFL_RD_FPROT3(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFL_FPROT2 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief FTFL_FPROT2 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which logical program flash regions are protected
 * from program and erase operations. Protected flash regions cannot have their
 * content changed; that is, these regions cannot be programmed and cannot be
 * erased by any flash command. Unprotected regions can be changed by program and
 * erase operations. The four FPROT registers allow 32 protectable regions. Each bit
 * protects a 1/32 region of the program flash memory . The bitfields are
 * defined in each register as follows: Program flash protection register Program flash
 * protection bits FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8]
 * FPROT3 PROT[7:0] During the reset sequence, the FPROT registers are loaded with the
 * contents of the program flash protection bytes in the Flash Configuration
 * Field as indicated in the following table. Program flash protection register
 * Flash Configuration Field offset address FPROT0 0x0008 FPROT1 0x0009 FPROT2 0x000A
 * FPROT3 0x000B To change the program flash protection that is loaded during
 * the reset sequence, unprotect the sector of program flash memory that contains
 * the Flash Configuration Field. Then, reprogram the program flash protection
 * byte.
 */
/*!
 * @name Constants and macros for entire FTFL_FPROT2 register
 */
/*@{*/
#define FTFL_RD_FPROT2(base)     (FTFL_FPROT2_REG(base))
#define FTFL_WR_FPROT2(base, value) (FTFL_FPROT2_REG(base) = (value))
#define FTFL_RMW_FPROT2(base, mask, value) (FTFL_WR_FPROT2(base, (FTFL_RD_FPROT2(base) & ~(mask)) | (value)))
#define FTFL_SET_FPROT2(base, value) (FTFL_WR_FPROT2(base, FTFL_RD_FPROT2(base) |  (value)))
#define FTFL_CLR_FPROT2(base, value) (FTFL_WR_FPROT2(base, FTFL_RD_FPROT2(base) & ~(value)))
#define FTFL_TOG_FPROT2(base, value) (FTFL_WR_FPROT2(base, FTFL_RD_FPROT2(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFL_FPROT1 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief FTFL_FPROT1 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which logical program flash regions are protected
 * from program and erase operations. Protected flash regions cannot have their
 * content changed; that is, these regions cannot be programmed and cannot be
 * erased by any flash command. Unprotected regions can be changed by program and
 * erase operations. The four FPROT registers allow 32 protectable regions. Each bit
 * protects a 1/32 region of the program flash memory . The bitfields are
 * defined in each register as follows: Program flash protection register Program flash
 * protection bits FPROT0 PROT[31:24] FPROT1 PROT[23:16] FPROT2 PROT[15:8]
 * FPROT3 PROT[7:0] During the reset sequence, the FPROT registers are loaded with the
 * contents of the program flash protection bytes in the Flash Configuration
 * Field as indicated in the following table. Program flash protection register
 * Flash Configuration Field offset address FPROT0 0x0008 FPROT1 0x0009 FPROT2 0x000A
 * FPROT3 0x000B To change the program flash protection that is loaded during
 * the reset sequence, unprotect the sector of program flash memory that contains
 * the Flash Configuration Field. Then, reprogram the program flash protection
 * byte.
 */
/*!
 * @name Constants and macros for entire FTFL_FPROT1 register
 */
/*@{*/
#define FTFL_RD_FPROT1(base)     (FTFL_FPROT1_REG(base))
#define FTFL_WR_FPROT1(base, value) (FTFL_FPROT1_REG(base) = (value))
#define FTFL_RMW_FPROT1(base, mask, value) (FTFL_WR_FPROT1(base, (FTFL_RD_FPROT1(base) & ~(mask)) | (value)))
#define FTFL_SET_FPROT1(base, value) (FTFL_WR_FPROT1(base, FTFL_RD_FPROT1(base) |  (value)))
#define FTFL_CLR_FPROT1(base, value) (FTFL_WR_FPROT1(base, FTFL_RD_FPROT1(base) & ~(value)))
#define FTFL_TOG_FPROT1(base, value) (FTFL_WR_FPROT1(base, FTFL_RD_FPROT1(base) ^  (value)))
/*@}*/

