RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*! @brief Set the LCLK field to a new value. */
#define LCD_WR_GCR_LCLK(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCLK_MASK, LCD_GCR_LCLK(value)))
#define LCD_BWR_GCR_LCLK(base, value) (LCD_WR_GCR_LCLK(base, value))
/*@}*/

/*!
 * @name Register LCD_GCR, field SOURCE[6] (RW)
 *
 * The LCD controller has two possible clock sources. This bit is used to select
 * which clock source is the basis for LCD clock. The clock sources are
 * chip-specific. For the clock source assignments, see the chapter that describes how
 * modules are configured.
 *
 * Values:
 * - 0b0 - Selects the default clock as the LCD clock source.
 * - 0b1 - Selects the alternate clock as the LCD clock source.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_SOURCE field. */
#define LCD_RD_GCR_SOURCE(base) ((LCD_GCR_REG(base) & LCD_GCR_SOURCE_MASK) >> LCD_GCR_SOURCE_SHIFT)
#define LCD_BRD_GCR_SOURCE(base) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_SOURCE_SHIFT))

/*! @brief Set the SOURCE field to a new value. */
#define LCD_WR_GCR_SOURCE(base, value) (LCD_RMW_GCR(base, LCD_GCR_SOURCE_MASK, LCD_GCR_SOURCE(value)))
#define LCD_BWR_GCR_SOURCE(base, value) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_SOURCE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDEN[7] (RW)
 *
 * Starts LCD controller waveform generator.
 *
 * Values:
 * - 0b0 - All front plane and back plane pins are disabled. The LCD controller
 *     system is also disabled, and all LCD waveform generation clocks are
 *     stopped. V LL3 is connected to V DD internally.
 * - 0b1 - LCD controller driver system is enabled, and front plane and back
 *     plane waveforms are generated. All LCD pins, LCD_Pn, enabled using the LCD
 *     Pin Enable register, output an LCD driver waveform. The back plane pins
 *     output an LCD driver back plane waveform based on the settings of DUTY[2:0].
 *     Charge pump or resistor bias is enabled.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_LCDEN field. */
#define LCD_RD_GCR_LCDEN(base) ((LCD_GCR_REG(base) & LCD_GCR_LCDEN_MASK) >> LCD_GCR_LCDEN_SHIFT)
#define LCD_BRD_GCR_LCDEN(base) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_LCDEN_SHIFT))

/*! @brief Set the LCDEN field to a new value. */
#define LCD_WR_GCR_LCDEN(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCDEN_MASK, LCD_GCR_LCDEN(value)))
#define LCD_BWR_GCR_LCDEN(base, value) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_LCDEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDSTP[8] (RW)
 *
 * LCD driver, charge pump, resistor bias network, and voltage regulator stop
 * while in Stop mode.
 *
 * Values:
 * - 0b0 - Allows the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator to continue running during Stop mode.
 * - 0b1 - Disables the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator when MCU enters Stop mode.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_LCDSTP field. */
#define LCD_RD_GCR_LCDSTP(base) ((LCD_GCR_REG(base) & LCD_GCR_LCDSTP_MASK) >> LCD_GCR_LCDSTP_SHIFT)
#define LCD_BRD_GCR_LCDSTP(base) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_LCDSTP_SHIFT))

/*! @brief Set the LCDSTP field to a new value. */
#define LCD_WR_GCR_LCDSTP(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCDSTP_MASK, LCD_GCR_LCDSTP(value)))
#define LCD_BWR_GCR_LCDSTP(base, value) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_LCDSTP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDWAIT[9] (RW)
 *
 * LCD driver, charge pump, resistor bias network, and voltage regulator stop
 * while in Wait mode.
 *
 * Values:
 * - 0b0 - Allows the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator to continue running during Wait mode.
 * - 0b1 - Disables the LCD driver, charge pump, resistor bias network, and
 *     voltage regulator when MCU enters Wait mode.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_LCDWAIT field. */
#define LCD_RD_GCR_LCDWAIT(base) ((LCD_GCR_REG(base) & LCD_GCR_LCDWAIT_MASK) >> LCD_GCR_LCDWAIT_SHIFT)
#define LCD_BRD_GCR_LCDWAIT(base) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_LCDWAIT_SHIFT))

/*! @brief Set the LCDWAIT field to a new value. */
#define LCD_WR_GCR_LCDWAIT(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCDWAIT_MASK, LCD_GCR_LCDWAIT(value)))
#define LCD_BWR_GCR_LCDWAIT(base, value) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_LCDWAIT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_GCR, field ALTDIV[13:12] (RW)
 *
 * Functions as a clock divider to divide the alternate clock before it is
 * selected as LCD clock source.
 *
 * Values:
 * - 0b00 - Divide factor = 1 (No divide)
 * - 0b01 - Divide factor = 8
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_ALTDIV field. */
#define LCD_RD_GCR_ALTDIV(base) ((LCD_GCR_REG(base) & LCD_GCR_ALTDIV_MASK) >> LCD_GCR_ALTDIV_SHIFT)
#define LCD_BRD_GCR_ALTDIV(base) (LCD_RD_GCR_ALTDIV(base))

/*! @brief Set the ALTDIV field to a new value. */
#define LCD_WR_GCR_ALTDIV(base, value) (LCD_RMW_GCR(base, LCD_GCR_ALTDIV_MASK, LCD_GCR_ALTDIV(value)))
#define LCD_BWR_GCR_ALTDIV(base, value) (LCD_WR_GCR_ALTDIV(base, value))
/*@}*/

/*!
 * @name Register LCD_GCR, field FDCIEN[14] (RW)
 *
 * Enables an LCD interrupt event when fault detection is completed.
 *
 * Values:
 * - 0b0 - No interrupt request is generated by this event.
 * - 0b1 - When a fault is detected and FDCF bit is set, this event causes an
 *     interrupt request.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_FDCIEN field. */
#define LCD_RD_GCR_FDCIEN(base) ((LCD_GCR_REG(base) & LCD_GCR_FDCIEN_MASK) >> LCD_GCR_FDCIEN_SHIFT)
#define LCD_BRD_GCR_FDCIEN(base) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_FDCIEN_SHIFT))

/*! @brief Set the FDCIEN field to a new value. */
#define LCD_WR_GCR_FDCIEN(base, value) (LCD_RMW_GCR(base, LCD_GCR_FDCIEN_MASK, LCD_GCR_FDCIEN(value)))
#define LCD_BWR_GCR_FDCIEN(base, value) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_FDCIEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_GCR, field LCDIEN[15] (RW)
 *
 * Enables an LCD interrupt event that coincides with the LCD controller frame
 * frequency.
 *
 * Values:
 * - 0b0 - No interrupt request is generated by this event.
 * - 0b1 - When LCDIF bit is set, this event causes an interrupt request.
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_LCDIEN field. */
#define LCD_RD_GCR_LCDIEN(base) ((LCD_GCR_REG(base) & LCD_GCR_LCDIEN_MASK) >> LCD_GCR_LCDIEN_SHIFT)
#define LCD_BRD_GCR_LCDIEN(base) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_LCDIEN_SHIFT))

/*! @brief Set the LCDIEN field to a new value. */
#define LCD_WR_GCR_LCDIEN(base, value) (LCD_RMW_GCR(base, LCD_GCR_LCDIEN_MASK, LCD_GCR_LCDIEN(value)))
#define LCD_BWR_GCR_LCDIEN(base, value) (BITBAND_ACCESS32(&LCD_GCR_REG(base), LCD_GCR_LCDIEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_GCR, field VSUPPLY[17:16] (RW)
 *
 * Configures whether the LCD controller power supply is external or internal.
 * Avoid modifying this field while the LCD controller is enabled, for example, if
 * LCDEN = 1.
 *
 * Values:
 * - 0b00 - Drive V LL2 internally from V DD .
 * - 0b01 - Drive V LL3 internally from V DD .
 * - 0b10 - Reserved
 * - 0b11 - Drive V LL3 externally from V DD or drive V LL1 internally from V
 *     IREG .
 */
/*@{*/
/*! @brief Read current value of the LCD_GCR_VSUPPLY field. */
#define LCD_RD_GCR_VSUPPLY(base) ((LCD_GCR_REG(base) & LCD_GCR_VSUPPLY_MASK) >> LCD_GCR_VSUPPLY_SHIFT)
#define LCD_BRD_GCR_VSUPPLY(base) (LCD_RD_GCR_VSUPPLY(base))

