RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*! @brief Set the BLANK field to a new value. */
#define LCD_WR_AR_BLANK(base, value) (LCD_RMW_AR(base, (LCD_AR_BLANK_MASK | LCD_AR_LCDIF_MASK), LCD_AR_BLANK(value)))
#define LCD_BWR_AR_BLANK(base, value) (BITBAND_ACCESS32(&LCD_AR_REG(base), LCD_AR_BLANK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_AR, field ALT[6] (RW)
 *
 * For four back planes or less, the LCD back plane sequencer changes to output
 * an alternate display. ALT bit is ignored if DUTY[2:0] is 101 or greater.
 *
 * Values:
 * - 0b0 - Normal display mode.
 * - 0b1 - Alternate display mode.
 */
/*@{*/
/*! @brief Read current value of the LCD_AR_ALT field. */
#define LCD_RD_AR_ALT(base)  ((LCD_AR_REG(base) & LCD_AR_ALT_MASK) >> LCD_AR_ALT_SHIFT)
#define LCD_BRD_AR_ALT(base) (BITBAND_ACCESS32(&LCD_AR_REG(base), LCD_AR_ALT_SHIFT))

/*! @brief Set the ALT field to a new value. */
#define LCD_WR_AR_ALT(base, value) (LCD_RMW_AR(base, (LCD_AR_ALT_MASK | LCD_AR_LCDIF_MASK), LCD_AR_ALT(value)))
#define LCD_BWR_AR_ALT(base, value) (BITBAND_ACCESS32(&LCD_AR_REG(base), LCD_AR_ALT_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_AR, field BLINK[7] (RW)
 *
 * Starts or stops SLCD blinking.
 *
 * Values:
 * - 0b0 - Disables blinking.
 * - 0b1 - Starts blinking at blinking frequency specified by LCD blink rate
 *     calculation.
 */
/*@{*/
/*! @brief Read current value of the LCD_AR_BLINK field. */
#define LCD_RD_AR_BLINK(base) ((LCD_AR_REG(base) & LCD_AR_BLINK_MASK) >> LCD_AR_BLINK_SHIFT)
#define LCD_BRD_AR_BLINK(base) (BITBAND_ACCESS32(&LCD_AR_REG(base), LCD_AR_BLINK_SHIFT))

/*! @brief Set the BLINK field to a new value. */
#define LCD_WR_AR_BLINK(base, value) (LCD_RMW_AR(base, (LCD_AR_BLINK_MASK | LCD_AR_LCDIF_MASK), LCD_AR_BLINK(value)))
#define LCD_BWR_AR_BLINK(base, value) (BITBAND_ACCESS32(&LCD_AR_REG(base), LCD_AR_BLINK_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_AR, field LCDIF[15] (W1C)
 *
 * Indicates a frame frequency interrupt condition has occurred. To clear the
 * interrupt, write 1 to LCDIF.
 *
 * Values:
 * - 0b0 - Frame frequency interrupt condition has not occurred.
 * - 0b1 - Start of SLCD frame has occurred.
 */
/*@{*/
/*! @brief Read current value of the LCD_AR_LCDIF field. */
#define LCD_RD_AR_LCDIF(base) ((LCD_AR_REG(base) & LCD_AR_LCDIF_MASK) >> LCD_AR_LCDIF_SHIFT)
#define LCD_BRD_AR_LCDIF(base) (BITBAND_ACCESS32(&LCD_AR_REG(base), LCD_AR_LCDIF_SHIFT))

/*! @brief Set the LCDIF field to a new value. */
#define LCD_WR_AR_LCDIF(base, value) (LCD_RMW_AR(base, LCD_AR_LCDIF_MASK, LCD_AR_LCDIF(value)))
#define LCD_BWR_AR_LCDIF(base, value) (BITBAND_ACCESS32(&LCD_AR_REG(base), LCD_AR_LCDIF_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * LCD_FDCR - LCD Fault Detect Control Register
 ******************************************************************************/

/*!
 * @brief LCD_FDCR - LCD Fault Detect Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The reset value of this register depends on the reset type: POR - 0x0000_0000
 */
/*!
 * @name Constants and macros for entire LCD_FDCR register
 */
/*@{*/
#define LCD_RD_FDCR(base)        (LCD_FDCR_REG(base))
#define LCD_WR_FDCR(base, value) (LCD_FDCR_REG(base) = (value))
#define LCD_RMW_FDCR(base, mask, value) (LCD_WR_FDCR(base, (LCD_RD_FDCR(base) & ~(mask)) | (value)))
#define LCD_SET_FDCR(base, value) (LCD_WR_FDCR(base, LCD_RD_FDCR(base) |  (value)))
#define LCD_CLR_FDCR(base, value) (LCD_WR_FDCR(base, LCD_RD_FDCR(base) & ~(value)))
#define LCD_TOG_FDCR(base, value) (LCD_WR_FDCR(base, LCD_RD_FDCR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual LCD_FDCR bitfields
 */

/*!
 * @name Register LCD_FDCR, field FDPINID[5:0] (RW)
 *
 * Specifies the LCD pin to be checked by pullup fault detection.
 *
 * Values:
 * - 0b000000 - Fault detection for LCD_P0 pin.
 * - 0b000001 - Fault detection for LCD_P1 pin.
 */
/*@{*/
/*! @brief Read current value of the LCD_FDCR_FDPINID field. */
#define LCD_RD_FDCR_FDPINID(base) ((LCD_FDCR_REG(base) & LCD_FDCR_FDPINID_MASK) >> LCD_FDCR_FDPINID_SHIFT)
#define LCD_BRD_FDCR_FDPINID(base) (LCD_RD_FDCR_FDPINID(base))

/*! @brief Set the FDPINID field to a new value. */
#define LCD_WR_FDCR_FDPINID(base, value) (LCD_RMW_FDCR(base, LCD_FDCR_FDPINID_MASK, LCD_FDCR_FDPINID(value)))
#define LCD_BWR_FDCR_FDPINID(base, value) (LCD_WR_FDCR_FDPINID(base, value))
/*@}*/

/*!
 * @name Register LCD_FDCR, field FDBPEN[6] (RW)
 *
 * Enables "back plane" timing for the fault detect circuit. FDBPEN = 0
 * generates front plane timing. This bit specifies the type of pin selected under fault
 * detect test.
 *
 * Values:
 * - 0b0 - Type of the selected pin under fault detect test is front plane.
 * - 0b1 - Type of the selected pin under fault detect test is back plane.
 */
/*@{*/
/*! @brief Read current value of the LCD_FDCR_FDBPEN field. */
#define LCD_RD_FDCR_FDBPEN(base) ((LCD_FDCR_REG(base) & LCD_FDCR_FDBPEN_MASK) >> LCD_FDCR_FDBPEN_SHIFT)
#define LCD_BRD_FDCR_FDBPEN(base) (BITBAND_ACCESS32(&LCD_FDCR_REG(base), LCD_FDCR_FDBPEN_SHIFT))

/*! @brief Set the FDBPEN field to a new value. */
#define LCD_WR_FDCR_FDBPEN(base, value) (LCD_RMW_FDCR(base, LCD_FDCR_FDBPEN_MASK, LCD_FDCR_FDBPEN(value)))
#define LCD_BWR_FDCR_FDBPEN(base, value) (BITBAND_ACCESS32(&LCD_FDCR_REG(base), LCD_FDCR_FDBPEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_FDCR, field FDEN[7] (RW)
 *
 * If LCDEN is 1, asserting FDEN inserts a test frame after normal LCD refresh
 * frame is completed. After the test frame is done, Fault detection complete flag
 * (FDCF) is set. When the test frame is done, a normal LCD refresh frame
 * starts. FDEN is one-shot register, it clears after FDCF is set. To initiate another
 * fault detection, FDEN must be set again.
 *
 * Values:
 * - 0b0 - Disable fault detection.
 * - 0b1 - Enable fault detection.
 */
/*@{*/
/*! @brief Read current value of the LCD_FDCR_FDEN field. */
#define LCD_RD_FDCR_FDEN(base) ((LCD_FDCR_REG(base) & LCD_FDCR_FDEN_MASK) >> LCD_FDCR_FDEN_SHIFT)
#define LCD_BRD_FDCR_FDEN(base) (BITBAND_ACCESS32(&LCD_FDCR_REG(base), LCD_FDCR_FDEN_SHIFT))

/*! @brief Set the FDEN field to a new value. */
#define LCD_WR_FDCR_FDEN(base, value) (LCD_RMW_FDCR(base, LCD_FDCR_FDEN_MASK, LCD_FDCR_FDEN(value)))
#define LCD_BWR_FDCR_FDEN(base, value) (BITBAND_ACCESS32(&LCD_FDCR_REG(base), LCD_FDCR_FDEN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_FDCR, field FDSWW[11:9] (RW)
 *
 * Specifies the sample window width of fault detection, in number of cycles in
 * the range from 4-512 (Sample window = 4*2 N ).
 *
 * Values:
 * - 0b000 - Sample window width is 4 sample clock cycles.
 * - 0b001 - Sample window width is 8 sample clock cycles.
 */
/*@{*/
/*! @brief Read current value of the LCD_FDCR_FDSWW field. */
#define LCD_RD_FDCR_FDSWW(base) ((LCD_FDCR_REG(base) & LCD_FDCR_FDSWW_MASK) >> LCD_FDCR_FDSWW_SHIFT)
#define LCD_BRD_FDCR_FDSWW(base) (LCD_RD_FDCR_FDSWW(base))

