RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*! @brief Set the WF13 field to a new value. */
#define LCD_WR_WF_WF13(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF13_MASK, LCD_WF_WF13(value)))
#define LCD_BWR_WF_WF13(base, index, value) (LCD_WR_WF_WF13(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF57[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P57 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF57 field. */
#define LCD_RD_WF_WF57(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF57_MASK) >> LCD_WF_WF57_SHIFT)
#define LCD_BRD_WF_WF57(base, index) (LCD_RD_WF_WF57(base, index))

/*! @brief Set the WF57 field to a new value. */
#define LCD_WR_WF_WF57(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF57_MASK, LCD_WF_WF57(value)))
#define LCD_BWR_WF_WF57(base, index, value) (LCD_WR_WF_WF57(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF53[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P53 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF53 field. */
#define LCD_RD_WF_WF53(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF53_MASK) >> LCD_WF_WF53_SHIFT)
#define LCD_BRD_WF_WF53(base, index) (LCD_RD_WF_WF53(base, index))

/*! @brief Set the WF53 field to a new value. */
#define LCD_WR_WF_WF53(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF53_MASK, LCD_WF_WF53(value)))
#define LCD_BWR_WF_WF53(base, index, value) (LCD_WR_WF_WF53(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF37[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P37 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF37 field. */
#define LCD_RD_WF_WF37(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF37_MASK) >> LCD_WF_WF37_SHIFT)
#define LCD_BRD_WF_WF37(base, index) (LCD_RD_WF_WF37(base, index))

/*! @brief Set the WF37 field to a new value. */
#define LCD_WR_WF_WF37(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF37_MASK, LCD_WF_WF37(value)))
#define LCD_BWR_WF_WF37(base, index, value) (LCD_WR_WF_WF37(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF9[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P9 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF9 field. */
#define LCD_RD_WF_WF9(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF9_MASK) >> LCD_WF_WF9_SHIFT)
#define LCD_BRD_WF_WF9(base, index) (LCD_RD_WF_WF9(base, index))

/*! @brief Set the WF9 field to a new value. */
#define LCD_WR_WF_WF9(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF9_MASK, LCD_WF_WF9(value)))
#define LCD_BWR_WF_WF9(base, index, value) (LCD_WR_WF_WF9(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF1[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P1 as described above for WF3.
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF1 field. */
#define LCD_RD_WF_WF1(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF1_MASK) >> LCD_WF_WF1_SHIFT)
#define LCD_BRD_WF_WF1(base, index) (LCD_RD_WF_WF1(base, index))

/*! @brief Set the WF1 field to a new value. */
#define LCD_WR_WF_WF1(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF1_MASK, LCD_WF_WF1(value)))
#define LCD_BWR_WF_WF1(base, index, value) (LCD_WR_WF_WF1(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF29[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P29 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF29 field. */
#define LCD_RD_WF_WF29(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF29_MASK) >> LCD_WF_WF29_SHIFT)
#define LCD_BRD_WF_WF29(base, index) (LCD_RD_WF_WF29(base, index))

/*! @brief Set the WF29 field to a new value. */
#define LCD_WR_WF_WF29(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF29_MASK, LCD_WF_WF29(value)))
#define LCD_BWR_WF_WF29(base, index, value) (LCD_WR_WF_WF29(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF33[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P33 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF33 field. */
#define LCD_RD_WF_WF33(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF33_MASK) >> LCD_WF_WF33_SHIFT)
#define LCD_BRD_WF_WF33(base, index) (LCD_RD_WF_WF33(base, index))

/*! @brief Set the WF33 field to a new value. */
#define LCD_WR_WF_WF33(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF33_MASK, LCD_WF_WF33(value)))
#define LCD_BWR_WF_WF33(base, index, value) (LCD_WR_WF_WF33(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF21[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P21 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF21 field. */
#define LCD_RD_WF_WF21(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF21_MASK) >> LCD_WF_WF21_SHIFT)
#define LCD_BRD_WF_WF21(base, index) (LCD_RD_WF_WF21(base, index))

/*! @brief Set the WF21 field to a new value. */
#define LCD_WR_WF_WF21(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF21_MASK, LCD_WF_WF21(value)))
#define LCD_BWR_WF_WF21(base, index, value) (LCD_WR_WF_WF21(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF26[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P26 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF26 field. */
#define LCD_RD_WF_WF26(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF26_MASK) >> LCD_WF_WF26_SHIFT)
#define LCD_BRD_WF_WF26(base, index) (LCD_RD_WF_WF26(base, index))

/*! @brief Set the WF26 field to a new value. */
#define LCD_WR_WF_WF26(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF26_MASK, LCD_WF_WF26(value)))
#define LCD_BWR_WF_WF26(base, index, value) (LCD_WR_WF_WF26(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF46[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P46 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF46 field. */
#define LCD_RD_WF_WF46(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF46_MASK) >> LCD_WF_WF46_SHIFT)
#define LCD_BRD_WF_WF46(base, index) (LCD_RD_WF_WF46(base, index))

/*! @brief Set the WF46 field to a new value. */
#define LCD_WR_WF_WF46(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF46_MASK, LCD_WF_WF46(value)))
#define LCD_BWR_WF_WF46(base, index, value) (LCD_WR_WF_WF46(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF6[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P6 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF6 field. */
#define LCD_RD_WF_WF6(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF6_MASK) >> LCD_WF_WF6_SHIFT)
#define LCD_BRD_WF_WF6(base, index) (LCD_RD_WF_WF6(base, index))

/*! @brief Set the WF6 field to a new value. */
#define LCD_WR_WF_WF6(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF6_MASK, LCD_WF_WF6(value)))
#define LCD_BWR_WF_WF6(base, index, value) (LCD_WR_WF_WF6(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF42[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P42 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF42 field. */
#define LCD_RD_WF_WF42(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF42_MASK) >> LCD_WF_WF42_SHIFT)
#define LCD_BRD_WF_WF42(base, index) (LCD_RD_WF_WF42(base, index))

/*! @brief Set the WF42 field to a new value. */
#define LCD_WR_WF_WF42(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF42_MASK, LCD_WF_WF42(value)))
#define LCD_BWR_WF_WF42(base, index, value) (LCD_WR_WF_WF42(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF18[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P18 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF18 field. */
#define LCD_RD_WF_WF18(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF18_MASK) >> LCD_WF_WF18_SHIFT)
#define LCD_BRD_WF_WF18(base, index) (LCD_RD_WF_WF18(base, index))

