RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*! @brief Set the BPALCD42 field to a new value. */
#define LCD_WR_WF8B_BPALCD42(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD42_MASK, LCD_WF8B_BPALCD42(value)))
#define LCD_BWR_WF8B_BPALCD42(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD42_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD41[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD41 field. */
#define LCD_RD_WF8B_BPALCD41(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD41_MASK) >> LCD_WF8B_BPALCD41_SHIFT)
#define LCD_BRD_WF8B_BPALCD41(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD41_SHIFT))

/*! @brief Set the BPALCD41 field to a new value. */
#define LCD_WR_WF8B_BPALCD41(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD41_MASK, LCD_WF8B_BPALCD41(value)))
#define LCD_BWR_WF8B_BPALCD41(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD41_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD40[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD40 field. */
#define LCD_RD_WF8B_BPALCD40(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD40_MASK) >> LCD_WF8B_BPALCD40_SHIFT)
#define LCD_BRD_WF8B_BPALCD40(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD40_SHIFT))

/*! @brief Set the BPALCD40 field to a new value. */
#define LCD_WR_WF8B_BPALCD40(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD40_MASK, LCD_WF8B_BPALCD40(value)))
#define LCD_BWR_WF8B_BPALCD40(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD40_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD39[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD39 field. */
#define LCD_RD_WF8B_BPALCD39(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD39_MASK) >> LCD_WF8B_BPALCD39_SHIFT)
#define LCD_BRD_WF8B_BPALCD39(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD39_SHIFT))

/*! @brief Set the BPALCD39 field to a new value. */
#define LCD_WR_WF8B_BPALCD39(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD39_MASK, LCD_WF8B_BPALCD39(value)))
#define LCD_BWR_WF8B_BPALCD39(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD39_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD38[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD38 field. */
#define LCD_RD_WF8B_BPALCD38(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD38_MASK) >> LCD_WF8B_BPALCD38_SHIFT)
#define LCD_BRD_WF8B_BPALCD38(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD38_SHIFT))

/*! @brief Set the BPALCD38 field to a new value. */
#define LCD_WR_WF8B_BPALCD38(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD38_MASK, LCD_WF8B_BPALCD38(value)))
#define LCD_BWR_WF8B_BPALCD38(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD38_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD37[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD37 field. */
#define LCD_RD_WF8B_BPALCD37(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD37_MASK) >> LCD_WF8B_BPALCD37_SHIFT)
#define LCD_BRD_WF8B_BPALCD37(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD37_SHIFT))

/*! @brief Set the BPALCD37 field to a new value. */
#define LCD_WR_WF8B_BPALCD37(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD37_MASK, LCD_WF8B_BPALCD37(value)))
#define LCD_BWR_WF8B_BPALCD37(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD37_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD36[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD36 field. */
#define LCD_RD_WF8B_BPALCD36(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD36_MASK) >> LCD_WF8B_BPALCD36_SHIFT)
#define LCD_BRD_WF8B_BPALCD36(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD36_SHIFT))

/*! @brief Set the BPALCD36 field to a new value. */
#define LCD_WR_WF8B_BPALCD36(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD36_MASK, LCD_WF8B_BPALCD36(value)))
#define LCD_BWR_WF8B_BPALCD36(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD36_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD4[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD4 field. */
#define LCD_RD_WF8B_BPALCD4(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD4_MASK) >> LCD_WF8B_BPALCD4_SHIFT)
#define LCD_BRD_WF8B_BPALCD4(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD4_SHIFT))

/*! @brief Set the BPALCD4 field to a new value. */
#define LCD_WR_WF8B_BPALCD4(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD4_MASK, LCD_WF8B_BPALCD4(value)))
#define LCD_BWR_WF8B_BPALCD4(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD4_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD35[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD35 field. */
#define LCD_RD_WF8B_BPALCD35(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD35_MASK) >> LCD_WF8B_BPALCD35_SHIFT)
#define LCD_BRD_WF8B_BPALCD35(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD35_SHIFT))

