RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*! @brief Set the BPALCD35 field to a new value. */
#define LCD_WR_WF8B_BPALCD35(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD35_MASK, LCD_WF8B_BPALCD35(value)))
#define LCD_BWR_WF8B_BPALCD35(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD35_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD34[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD34 field. */
#define LCD_RD_WF8B_BPALCD34(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD34_MASK) >> LCD_WF8B_BPALCD34_SHIFT)
#define LCD_BRD_WF8B_BPALCD34(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD34_SHIFT))

/*! @brief Set the BPALCD34 field to a new value. */
#define LCD_WR_WF8B_BPALCD34(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD34_MASK, LCD_WF8B_BPALCD34(value)))
#define LCD_BWR_WF8B_BPALCD34(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD34_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD33[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD33 field. */
#define LCD_RD_WF8B_BPALCD33(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD33_MASK) >> LCD_WF8B_BPALCD33_SHIFT)
#define LCD_BRD_WF8B_BPALCD33(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD33_SHIFT))

/*! @brief Set the BPALCD33 field to a new value. */
#define LCD_WR_WF8B_BPALCD33(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD33_MASK, LCD_WF8B_BPALCD33(value)))
#define LCD_BWR_WF8B_BPALCD33(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD33_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD32[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD32 field. */
#define LCD_RD_WF8B_BPALCD32(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD32_MASK) >> LCD_WF8B_BPALCD32_SHIFT)
#define LCD_BRD_WF8B_BPALCD32(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD32_SHIFT))

/*! @brief Set the BPALCD32 field to a new value. */
#define LCD_WR_WF8B_BPALCD32(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD32_MASK, LCD_WF8B_BPALCD32(value)))
#define LCD_BWR_WF8B_BPALCD32(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD32_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD31[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD31 field. */
#define LCD_RD_WF8B_BPALCD31(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD31_MASK) >> LCD_WF8B_BPALCD31_SHIFT)
#define LCD_BRD_WF8B_BPALCD31(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD31_SHIFT))

/*! @brief Set the BPALCD31 field to a new value. */
#define LCD_WR_WF8B_BPALCD31(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD31_MASK, LCD_WF8B_BPALCD31(value)))
#define LCD_BWR_WF8B_BPALCD31(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD31_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD30[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD30 field. */
#define LCD_RD_WF8B_BPALCD30(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD30_MASK) >> LCD_WF8B_BPALCD30_SHIFT)
#define LCD_BRD_WF8B_BPALCD30(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD30_SHIFT))

/*! @brief Set the BPALCD30 field to a new value. */
#define LCD_WR_WF8B_BPALCD30(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD30_MASK, LCD_WF8B_BPALCD30(value)))
#define LCD_BWR_WF8B_BPALCD30(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD30_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD29[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD29 field. */
#define LCD_RD_WF8B_BPALCD29(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD29_MASK) >> LCD_WF8B_BPALCD29_SHIFT)
#define LCD_BRD_WF8B_BPALCD29(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD29_SHIFT))

/*! @brief Set the BPALCD29 field to a new value. */
#define LCD_WR_WF8B_BPALCD29(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD29_MASK, LCD_WF8B_BPALCD29(value)))
#define LCD_BWR_WF8B_BPALCD29(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD29_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD5[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD5 field. */
#define LCD_RD_WF8B_BPALCD5(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD5_MASK) >> LCD_WF8B_BPALCD5_SHIFT)
#define LCD_BRD_WF8B_BPALCD5(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD5_SHIFT))

/*! @brief Set the BPALCD5 field to a new value. */
#define LCD_WR_WF8B_BPALCD5(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD5_MASK, LCD_WF8B_BPALCD5(value)))
#define LCD_BWR_WF8B_BPALCD5(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD5_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD28[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD28 field. */
#define LCD_RD_WF8B_BPALCD28(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD28_MASK) >> LCD_WF8B_BPALCD28_SHIFT)
#define LCD_BRD_WF8B_BPALCD28(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD28_SHIFT))

