RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*! @brief Set the BPALCD28 field to a new value. */
#define LCD_WR_WF8B_BPALCD28(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD28_MASK, LCD_WF8B_BPALCD28(value)))
#define LCD_BWR_WF8B_BPALCD28(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD28_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD27[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD27 field. */
#define LCD_RD_WF8B_BPALCD27(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD27_MASK) >> LCD_WF8B_BPALCD27_SHIFT)
#define LCD_BRD_WF8B_BPALCD27(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD27_SHIFT))

/*! @brief Set the BPALCD27 field to a new value. */
#define LCD_WR_WF8B_BPALCD27(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD27_MASK, LCD_WF8B_BPALCD27(value)))
#define LCD_BWR_WF8B_BPALCD27(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD27_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD26[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD26 field. */
#define LCD_RD_WF8B_BPALCD26(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD26_MASK) >> LCD_WF8B_BPALCD26_SHIFT)
#define LCD_BRD_WF8B_BPALCD26(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD26_SHIFT))

/*! @brief Set the BPALCD26 field to a new value. */
#define LCD_WR_WF8B_BPALCD26(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD26_MASK, LCD_WF8B_BPALCD26(value)))
#define LCD_BWR_WF8B_BPALCD26(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD26_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD25[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD25 field. */
#define LCD_RD_WF8B_BPALCD25(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD25_MASK) >> LCD_WF8B_BPALCD25_SHIFT)
#define LCD_BRD_WF8B_BPALCD25(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD25_SHIFT))

/*! @brief Set the BPALCD25 field to a new value. */
#define LCD_WR_WF8B_BPALCD25(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD25_MASK, LCD_WF8B_BPALCD25(value)))
#define LCD_BWR_WF8B_BPALCD25(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD25_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD24[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD24 field. */
#define LCD_RD_WF8B_BPALCD24(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD24_MASK) >> LCD_WF8B_BPALCD24_SHIFT)
#define LCD_BRD_WF8B_BPALCD24(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD24_SHIFT))

/*! @brief Set the BPALCD24 field to a new value. */
#define LCD_WR_WF8B_BPALCD24(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD24_MASK, LCD_WF8B_BPALCD24(value)))
#define LCD_BWR_WF8B_BPALCD24(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD24_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD23[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD23 field. */
#define LCD_RD_WF8B_BPALCD23(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD23_MASK) >> LCD_WF8B_BPALCD23_SHIFT)
#define LCD_BRD_WF8B_BPALCD23(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD23_SHIFT))

/*! @brief Set the BPALCD23 field to a new value. */
#define LCD_WR_WF8B_BPALCD23(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD23_MASK, LCD_WF8B_BPALCD23(value)))
#define LCD_BWR_WF8B_BPALCD23(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD23_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD22[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD22 field. */
#define LCD_RD_WF8B_BPALCD22(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD22_MASK) >> LCD_WF8B_BPALCD22_SHIFT)
#define LCD_BRD_WF8B_BPALCD22(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD22_SHIFT))

/*! @brief Set the BPALCD22 field to a new value. */
#define LCD_WR_WF8B_BPALCD22(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD22_MASK, LCD_WF8B_BPALCD22(value)))
#define LCD_BWR_WF8B_BPALCD22(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD22_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD6[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD6 field. */
#define LCD_RD_WF8B_BPALCD6(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD6_MASK) >> LCD_WF8B_BPALCD6_SHIFT)
#define LCD_BRD_WF8B_BPALCD6(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD6_SHIFT))

/*! @brief Set the BPALCD6 field to a new value. */
#define LCD_WR_WF8B_BPALCD6(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD6_MASK, LCD_WF8B_BPALCD6(value)))
#define LCD_BWR_WF8B_BPALCD6(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD6_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD21[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD21 field. */
#define LCD_RD_WF8B_BPALCD21(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD21_MASK) >> LCD_WF8B_BPALCD21_SHIFT)
#define LCD_BRD_WF8B_BPALCD21(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD21_SHIFT))

/*! @brief Set the BPALCD21 field to a new value. */
#define LCD_WR_WF8B_BPALCD21(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD21_MASK, LCD_WF8B_BPALCD21(value)))
#define LCD_BWR_WF8B_BPALCD21(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD21_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD20[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD20 field. */
#define LCD_RD_WF8B_BPALCD20(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD20_MASK) >> LCD_WF8B_BPALCD20_SHIFT)
#define LCD_BRD_WF8B_BPALCD20(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD20_SHIFT))

