RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*! @brief Set the BPBLCD0 field to a new value. */
#define LCD_WR_WF8B_BPBLCD0(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD0_MASK, LCD_WF8B_BPBLCD0(value)))
#define LCD_BWR_WF8B_BPBLCD0(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD55[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD55 field. */
#define LCD_RD_WF8B_BPBLCD55(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD55_MASK) >> LCD_WF8B_BPBLCD55_SHIFT)
#define LCD_BRD_WF8B_BPBLCD55(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD55_SHIFT))

/*! @brief Set the BPBLCD55 field to a new value. */
#define LCD_WR_WF8B_BPBLCD55(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD55_MASK, LCD_WF8B_BPBLCD55(value)))
#define LCD_BWR_WF8B_BPBLCD55(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD55_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD56[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD56 field. */
#define LCD_RD_WF8B_BPBLCD56(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD56_MASK) >> LCD_WF8B_BPBLCD56_SHIFT)
#define LCD_BRD_WF8B_BPBLCD56(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD56_SHIFT))

/*! @brief Set the BPBLCD56 field to a new value. */
#define LCD_WR_WF8B_BPBLCD56(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD56_MASK, LCD_WF8B_BPBLCD56(value)))
#define LCD_BWR_WF8B_BPBLCD56(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD56_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD21[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD21 field. */
#define LCD_RD_WF8B_BPBLCD21(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD21_MASK) >> LCD_WF8B_BPBLCD21_SHIFT)
#define LCD_BRD_WF8B_BPBLCD21(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD21_SHIFT))

/*! @brief Set the BPBLCD21 field to a new value. */
#define LCD_WR_WF8B_BPBLCD21(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD21_MASK, LCD_WF8B_BPBLCD21(value)))
#define LCD_BWR_WF8B_BPBLCD21(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD21_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD6[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD6 field. */
#define LCD_RD_WF8B_BPBLCD6(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD6_MASK) >> LCD_WF8B_BPBLCD6_SHIFT)
#define LCD_BRD_WF8B_BPBLCD6(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD6_SHIFT))

/*! @brief Set the BPBLCD6 field to a new value. */
#define LCD_WR_WF8B_BPBLCD6(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD6_MASK, LCD_WF8B_BPBLCD6(value)))
#define LCD_BWR_WF8B_BPBLCD6(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD6_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD29[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD29 field. */
#define LCD_RD_WF8B_BPBLCD29(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD29_MASK) >> LCD_WF8B_BPBLCD29_SHIFT)
#define LCD_BRD_WF8B_BPBLCD29(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD29_SHIFT))

/*! @brief Set the BPBLCD29 field to a new value. */
#define LCD_WR_WF8B_BPBLCD29(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD29_MASK, LCD_WF8B_BPBLCD29(value)))
#define LCD_BWR_WF8B_BPBLCD29(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD29_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD25[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD25 field. */
#define LCD_RD_WF8B_BPBLCD25(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD25_MASK) >> LCD_WF8B_BPBLCD25_SHIFT)
#define LCD_BRD_WF8B_BPBLCD25(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD25_SHIFT))

/*! @brief Set the BPBLCD25 field to a new value. */
#define LCD_WR_WF8B_BPBLCD25(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD25_MASK, LCD_WF8B_BPBLCD25(value)))
#define LCD_BWR_WF8B_BPBLCD25(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD25_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD8[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD8 field. */
#define LCD_RD_WF8B_BPBLCD8(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD8_MASK) >> LCD_WF8B_BPBLCD8_SHIFT)
#define LCD_BRD_WF8B_BPBLCD8(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD8_SHIFT))

/*! @brief Set the BPBLCD8 field to a new value. */
#define LCD_WR_WF8B_BPBLCD8(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD8_MASK, LCD_WF8B_BPBLCD8(value)))
#define LCD_BWR_WF8B_BPBLCD8(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD8_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD54[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD54 field. */
#define LCD_RD_WF8B_BPBLCD54(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD54_MASK) >> LCD_WF8B_BPBLCD54_SHIFT)
#define LCD_BRD_WF8B_BPBLCD54(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD54_SHIFT))

/*! @brief Set the BPBLCD54 field to a new value. */
#define LCD_WR_WF8B_BPBLCD54(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD54_MASK, LCD_WF8B_BPBLCD54(value)))
#define LCD_BWR_WF8B_BPBLCD54(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD54_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD38[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD38 field. */
#define LCD_RD_WF8B_BPBLCD38(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD38_MASK) >> LCD_WF8B_BPBLCD38_SHIFT)
#define LCD_BRD_WF8B_BPBLCD38(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD38_SHIFT))

/*! @brief Set the BPBLCD38 field to a new value. */
#define LCD_WR_WF8B_BPBLCD38(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPBLCD38_MASK, LCD_WF8B_BPBLCD38(value)))
#define LCD_BWR_WF8B_BPBLCD38(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD38_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPBLCD43[1] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase B
 * - 0b1 - LCD segment on or LCD backplane active for phase B
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPBLCD43 field. */
#define LCD_RD_WF8B_BPBLCD43(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPBLCD43_MASK) >> LCD_WF8B_BPBLCD43_SHIFT)
#define LCD_BRD_WF8B_BPBLCD43(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPBLCD43_SHIFT))

