RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*! @brief Set the BPDLCD17 field to a new value. */
#define LCD_WR_WF8B_BPDLCD17(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD17_MASK, LCD_WF8B_BPDLCD17(value)))
#define LCD_BWR_WF8B_BPDLCD17(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD17_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD27[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD27 field. */
#define LCD_RD_WF8B_BPDLCD27(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD27_MASK) >> LCD_WF8B_BPDLCD27_SHIFT)
#define LCD_BRD_WF8B_BPDLCD27(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD27_SHIFT))

/*! @brief Set the BPDLCD27 field to a new value. */
#define LCD_WR_WF8B_BPDLCD27(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD27_MASK, LCD_WF8B_BPDLCD27(value)))
#define LCD_BWR_WF8B_BPDLCD27(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD27_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD53[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD53 field. */
#define LCD_RD_WF8B_BPDLCD53(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD53_MASK) >> LCD_WF8B_BPDLCD53_SHIFT)
#define LCD_BRD_WF8B_BPDLCD53(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD53_SHIFT))

/*! @brief Set the BPDLCD53 field to a new value. */
#define LCD_WR_WF8B_BPDLCD53(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD53_MASK, LCD_WF8B_BPDLCD53(value)))
#define LCD_BWR_WF8B_BPDLCD53(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD53_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD51[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD51 field. */
#define LCD_RD_WF8B_BPDLCD51(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD51_MASK) >> LCD_WF8B_BPDLCD51_SHIFT)
#define LCD_BRD_WF8B_BPDLCD51(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD51_SHIFT))

/*! @brief Set the BPDLCD51 field to a new value. */
#define LCD_WR_WF8B_BPDLCD51(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD51_MASK, LCD_WF8B_BPDLCD51(value)))
#define LCD_BWR_WF8B_BPDLCD51(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD51_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD54[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD54 field. */
#define LCD_RD_WF8B_BPDLCD54(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD54_MASK) >> LCD_WF8B_BPDLCD54_SHIFT)
#define LCD_BRD_WF8B_BPDLCD54(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD54_SHIFT))

/*! @brief Set the BPDLCD54 field to a new value. */
#define LCD_WR_WF8B_BPDLCD54(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD54_MASK, LCD_WF8B_BPDLCD54(value)))
#define LCD_BWR_WF8B_BPDLCD54(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD54_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD13[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD13 field. */
#define LCD_RD_WF8B_BPDLCD13(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD13_MASK) >> LCD_WF8B_BPDLCD13_SHIFT)
#define LCD_BRD_WF8B_BPDLCD13(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD13_SHIFT))

/*! @brief Set the BPDLCD13 field to a new value. */
#define LCD_WR_WF8B_BPDLCD13(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD13_MASK, LCD_WF8B_BPDLCD13(value)))
#define LCD_BWR_WF8B_BPDLCD13(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD13_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD16[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD16 field. */
#define LCD_RD_WF8B_BPDLCD16(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD16_MASK) >> LCD_WF8B_BPDLCD16_SHIFT)
#define LCD_BRD_WF8B_BPDLCD16(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD16_SHIFT))

/*! @brief Set the BPDLCD16 field to a new value. */
#define LCD_WR_WF8B_BPDLCD16(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD16_MASK, LCD_WF8B_BPDLCD16(value)))
#define LCD_BWR_WF8B_BPDLCD16(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD16_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD32[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD32 field. */
#define LCD_RD_WF8B_BPDLCD32(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD32_MASK) >> LCD_WF8B_BPDLCD32_SHIFT)
#define LCD_BRD_WF8B_BPDLCD32(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD32_SHIFT))

/*! @brief Set the BPDLCD32 field to a new value. */
#define LCD_WR_WF8B_BPDLCD32(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD32_MASK, LCD_WF8B_BPDLCD32(value)))
#define LCD_BWR_WF8B_BPDLCD32(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD32_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD14[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD14 field. */
#define LCD_RD_WF8B_BPDLCD14(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD14_MASK) >> LCD_WF8B_BPDLCD14_SHIFT)
#define LCD_BRD_WF8B_BPDLCD14(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD14_SHIFT))

