RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*! @brief Set the BPDLCD14 field to a new value. */
#define LCD_WR_WF8B_BPDLCD14(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD14_MASK, LCD_WF8B_BPDLCD14(value)))
#define LCD_BWR_WF8B_BPDLCD14(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD14_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD28[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD28 field. */
#define LCD_RD_WF8B_BPDLCD28(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD28_MASK) >> LCD_WF8B_BPDLCD28_SHIFT)
#define LCD_BRD_WF8B_BPDLCD28(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD28_SHIFT))

/*! @brief Set the BPDLCD28 field to a new value. */
#define LCD_WR_WF8B_BPDLCD28(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD28_MASK, LCD_WF8B_BPDLCD28(value)))
#define LCD_BWR_WF8B_BPDLCD28(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD28_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD43[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD43 field. */
#define LCD_RD_WF8B_BPDLCD43(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD43_MASK) >> LCD_WF8B_BPDLCD43_SHIFT)
#define LCD_BRD_WF8B_BPDLCD43(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD43_SHIFT))

/*! @brief Set the BPDLCD43 field to a new value. */
#define LCD_WR_WF8B_BPDLCD43(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD43_MASK, LCD_WF8B_BPDLCD43(value)))
#define LCD_BWR_WF8B_BPDLCD43(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD43_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD4[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD4 field. */
#define LCD_RD_WF8B_BPDLCD4(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD4_MASK) >> LCD_WF8B_BPDLCD4_SHIFT)
#define LCD_BRD_WF8B_BPDLCD4(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD4_SHIFT))

/*! @brief Set the BPDLCD4 field to a new value. */
#define LCD_WR_WF8B_BPDLCD4(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD4_MASK, LCD_WF8B_BPDLCD4(value)))
#define LCD_BWR_WF8B_BPDLCD4(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD4_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD45[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD45 field. */
#define LCD_RD_WF8B_BPDLCD45(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD45_MASK) >> LCD_WF8B_BPDLCD45_SHIFT)
#define LCD_BRD_WF8B_BPDLCD45(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD45_SHIFT))

/*! @brief Set the BPDLCD45 field to a new value. */
#define LCD_WR_WF8B_BPDLCD45(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD45_MASK, LCD_WF8B_BPDLCD45(value)))
#define LCD_BWR_WF8B_BPDLCD45(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD45_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD8[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD8 field. */
#define LCD_RD_WF8B_BPDLCD8(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD8_MASK) >> LCD_WF8B_BPDLCD8_SHIFT)
#define LCD_BRD_WF8B_BPDLCD8(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD8_SHIFT))

/*! @brief Set the BPDLCD8 field to a new value. */
#define LCD_WR_WF8B_BPDLCD8(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD8_MASK, LCD_WF8B_BPDLCD8(value)))
#define LCD_BWR_WF8B_BPDLCD8(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD8_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD62[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD62 field. */
#define LCD_RD_WF8B_BPDLCD62(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD62_MASK) >> LCD_WF8B_BPDLCD62_SHIFT)
#define LCD_BRD_WF8B_BPDLCD62(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD62_SHIFT))

/*! @brief Set the BPDLCD62 field to a new value. */
#define LCD_WR_WF8B_BPDLCD62(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD62_MASK, LCD_WF8B_BPDLCD62(value)))
#define LCD_BWR_WF8B_BPDLCD62(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD62_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD33[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD33 field. */
#define LCD_RD_WF8B_BPDLCD33(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD33_MASK) >> LCD_WF8B_BPDLCD33_SHIFT)
#define LCD_BRD_WF8B_BPDLCD33(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD33_SHIFT))

/*! @brief Set the BPDLCD33 field to a new value. */
#define LCD_WR_WF8B_BPDLCD33(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD33_MASK, LCD_WF8B_BPDLCD33(value)))
#define LCD_BWR_WF8B_BPDLCD33(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD33_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD34[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD34 field. */
#define LCD_RD_WF8B_BPDLCD34(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD34_MASK) >> LCD_WF8B_BPDLCD34_SHIFT)
#define LCD_BRD_WF8B_BPDLCD34(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD34_SHIFT))

/*! @brief Set the BPDLCD34 field to a new value. */
#define LCD_WR_WF8B_BPDLCD34(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD34_MASK, LCD_WF8B_BPDLCD34(value)))
#define LCD_BWR_WF8B_BPDLCD34(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD34_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD29[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD29 field. */
#define LCD_RD_WF8B_BPDLCD29(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD29_MASK) >> LCD_WF8B_BPDLCD29_SHIFT)
#define LCD_BRD_WF8B_BPDLCD29(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD29_SHIFT))

/*! @brief Set the BPDLCD29 field to a new value. */
#define LCD_WR_WF8B_BPDLCD29(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD29_MASK, LCD_WF8B_BPDLCD29(value)))
#define LCD_BWR_WF8B_BPDLCD29(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD29_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD58[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD58 field. */
#define LCD_RD_WF8B_BPDLCD58(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD58_MASK) >> LCD_WF8B_BPDLCD58_SHIFT)
#define LCD_BRD_WF8B_BPDLCD58(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD58_SHIFT))

/*! @brief Set the BPDLCD58 field to a new value. */
#define LCD_WR_WF8B_BPDLCD58(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD58_MASK, LCD_WF8B_BPDLCD58(value)))
#define LCD_BWR_WF8B_BPDLCD58(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD58_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD57[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD57 field. */
#define LCD_RD_WF8B_BPDLCD57(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD57_MASK) >> LCD_WF8B_BPDLCD57_SHIFT)
#define LCD_BRD_WF8B_BPDLCD57(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD57_SHIFT))

/*! @brief Set the BPDLCD57 field to a new value. */
#define LCD_WR_WF8B_BPDLCD57(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD57_MASK, LCD_WF8B_BPDLCD57(value)))
#define LCD_BWR_WF8B_BPDLCD57(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD57_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD42[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD42 field. */
#define LCD_RD_WF8B_BPDLCD42(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD42_MASK) >> LCD_WF8B_BPDLCD42_SHIFT)
#define LCD_BRD_WF8B_BPDLCD42(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD42_SHIFT))

/*! @brief Set the BPDLCD42 field to a new value. */
#define LCD_WR_WF8B_BPDLCD42(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD42_MASK, LCD_WF8B_BPDLCD42(value)))
#define LCD_BWR_WF8B_BPDLCD42(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD42_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD35[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD35 field. */
#define LCD_RD_WF8B_BPDLCD35(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD35_MASK) >> LCD_WF8B_BPDLCD35_SHIFT)
#define LCD_BRD_WF8B_BPDLCD35(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD35_SHIFT))

/*! @brief Set the BPDLCD35 field to a new value. */
#define LCD_WR_WF8B_BPDLCD35(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPDLCD35_MASK, LCD_WF8B_BPDLCD35(value)))
#define LCD_BWR_WF8B_BPDLCD35(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD35_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD52[3] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase D
 * - 0b1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD52 field. */
#define LCD_RD_WF8B_BPDLCD52(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD52_MASK) >> LCD_WF8B_BPDLCD52_SHIFT)
#define LCD_BRD_WF8B_BPDLCD52(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD52_SHIFT))

