RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*! @brief Set the BPFLCD48 field to a new value. */
#define LCD_WR_WF8B_BPFLCD48(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD48_MASK, LCD_WF8B_BPFLCD48(value)))
#define LCD_BWR_WF8B_BPFLCD48(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD48_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD7[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD7 field. */
#define LCD_RD_WF8B_BPFLCD7(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD7_MASK) >> LCD_WF8B_BPFLCD7_SHIFT)
#define LCD_BRD_WF8B_BPFLCD7(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD7_SHIFT))

/*! @brief Set the BPFLCD7 field to a new value. */
#define LCD_WR_WF8B_BPFLCD7(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD7_MASK, LCD_WF8B_BPFLCD7(value)))
#define LCD_BWR_WF8B_BPFLCD7(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD7_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD22[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD22 field. */
#define LCD_RD_WF8B_BPFLCD22(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD22_MASK) >> LCD_WF8B_BPFLCD22_SHIFT)
#define LCD_BRD_WF8B_BPFLCD22(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD22_SHIFT))

/*! @brief Set the BPFLCD22 field to a new value. */
#define LCD_WR_WF8B_BPFLCD22(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD22_MASK, LCD_WF8B_BPFLCD22(value)))
#define LCD_BWR_WF8B_BPFLCD22(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD22_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD38[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD38 field. */
#define LCD_RD_WF8B_BPFLCD38(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD38_MASK) >> LCD_WF8B_BPFLCD38_SHIFT)
#define LCD_BRD_WF8B_BPFLCD38(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD38_SHIFT))

/*! @brief Set the BPFLCD38 field to a new value. */
#define LCD_WR_WF8B_BPFLCD38(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD38_MASK, LCD_WF8B_BPFLCD38(value)))
#define LCD_BWR_WF8B_BPFLCD38(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD38_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD12[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD12 field. */
#define LCD_RD_WF8B_BPFLCD12(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD12_MASK) >> LCD_WF8B_BPFLCD12_SHIFT)
#define LCD_BRD_WF8B_BPFLCD12(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD12_SHIFT))

/*! @brief Set the BPFLCD12 field to a new value. */
#define LCD_WR_WF8B_BPFLCD12(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD12_MASK, LCD_WF8B_BPFLCD12(value)))
#define LCD_BWR_WF8B_BPFLCD12(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD12_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD23[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD23 field. */
#define LCD_RD_WF8B_BPFLCD23(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD23_MASK) >> LCD_WF8B_BPFLCD23_SHIFT)
#define LCD_BRD_WF8B_BPFLCD23(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD23_SHIFT))

/*! @brief Set the BPFLCD23 field to a new value. */
#define LCD_WR_WF8B_BPFLCD23(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD23_MASK, LCD_WF8B_BPFLCD23(value)))
#define LCD_BWR_WF8B_BPFLCD23(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD23_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD14[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD14 field. */
#define LCD_RD_WF8B_BPGLCD14(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD14_MASK) >> LCD_WF8B_BPGLCD14_SHIFT)
#define LCD_BRD_WF8B_BPGLCD14(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD14_SHIFT))

/*! @brief Set the BPGLCD14 field to a new value. */
#define LCD_WR_WF8B_BPGLCD14(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD14_MASK, LCD_WF8B_BPGLCD14(value)))
#define LCD_BWR_WF8B_BPGLCD14(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD14_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD55[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD55 field. */
#define LCD_RD_WF8B_BPGLCD55(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD55_MASK) >> LCD_WF8B_BPGLCD55_SHIFT)
#define LCD_BRD_WF8B_BPGLCD55(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD55_SHIFT))

/*! @brief Set the BPGLCD55 field to a new value. */
#define LCD_WR_WF8B_BPGLCD55(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD55_MASK, LCD_WF8B_BPGLCD55(value)))
#define LCD_BWR_WF8B_BPGLCD55(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD55_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD63[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD63 field. */
#define LCD_RD_WF8B_BPGLCD63(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD63_MASK) >> LCD_WF8B_BPGLCD63_SHIFT)
#define LCD_BRD_WF8B_BPGLCD63(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD63_SHIFT))

/*! @brief Set the BPGLCD63 field to a new value. */
#define LCD_WR_WF8B_BPGLCD63(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD63_MASK, LCD_WF8B_BPGLCD63(value)))
#define LCD_BWR_WF8B_BPGLCD63(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD63_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD15[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD15 field. */
#define LCD_RD_WF8B_BPGLCD15(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD15_MASK) >> LCD_WF8B_BPGLCD15_SHIFT)
#define LCD_BRD_WF8B_BPGLCD15(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD15_SHIFT))

