RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*! @brief Set the BPGLCD15 field to a new value. */
#define LCD_WR_WF8B_BPGLCD15(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD15_MASK, LCD_WF8B_BPGLCD15(value)))
#define LCD_BWR_WF8B_BPGLCD15(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD15_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD62[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD62 field. */
#define LCD_RD_WF8B_BPGLCD62(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD62_MASK) >> LCD_WF8B_BPGLCD62_SHIFT)
#define LCD_BRD_WF8B_BPGLCD62(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD62_SHIFT))

/*! @brief Set the BPGLCD62 field to a new value. */
#define LCD_WR_WF8B_BPGLCD62(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD62_MASK, LCD_WF8B_BPGLCD62(value)))
#define LCD_BWR_WF8B_BPGLCD62(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD62_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD54[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD54 field. */
#define LCD_RD_WF8B_BPGLCD54(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD54_MASK) >> LCD_WF8B_BPGLCD54_SHIFT)
#define LCD_BRD_WF8B_BPGLCD54(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD54_SHIFT))

/*! @brief Set the BPGLCD54 field to a new value. */
#define LCD_WR_WF8B_BPGLCD54(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD54_MASK, LCD_WF8B_BPGLCD54(value)))
#define LCD_BWR_WF8B_BPGLCD54(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD54_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD61[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD61 field. */
#define LCD_RD_WF8B_BPGLCD61(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD61_MASK) >> LCD_WF8B_BPGLCD61_SHIFT)
#define LCD_BRD_WF8B_BPGLCD61(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD61_SHIFT))

/*! @brief Set the BPGLCD61 field to a new value. */
#define LCD_WR_WF8B_BPGLCD61(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD61_MASK, LCD_WF8B_BPGLCD61(value)))
#define LCD_BWR_WF8B_BPGLCD61(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD61_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD60[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD60 field. */
#define LCD_RD_WF8B_BPGLCD60(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD60_MASK) >> LCD_WF8B_BPGLCD60_SHIFT)
#define LCD_BRD_WF8B_BPGLCD60(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD60_SHIFT))

/*! @brief Set the BPGLCD60 field to a new value. */
#define LCD_WR_WF8B_BPGLCD60(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD60_MASK, LCD_WF8B_BPGLCD60(value)))
#define LCD_BWR_WF8B_BPGLCD60(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD60_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD59[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD59 field. */
#define LCD_RD_WF8B_BPGLCD59(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD59_MASK) >> LCD_WF8B_BPGLCD59_SHIFT)
#define LCD_BRD_WF8B_BPGLCD59(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD59_SHIFT))

/*! @brief Set the BPGLCD59 field to a new value. */
#define LCD_WR_WF8B_BPGLCD59(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD59_MASK, LCD_WF8B_BPGLCD59(value)))
#define LCD_BWR_WF8B_BPGLCD59(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD59_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD53[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD53 field. */
#define LCD_RD_WF8B_BPGLCD53(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD53_MASK) >> LCD_WF8B_BPGLCD53_SHIFT)
#define LCD_BRD_WF8B_BPGLCD53(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD53_SHIFT))

/*! @brief Set the BPGLCD53 field to a new value. */
#define LCD_WR_WF8B_BPGLCD53(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD53_MASK, LCD_WF8B_BPGLCD53(value)))
#define LCD_BWR_WF8B_BPGLCD53(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD53_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD58[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD58 field. */
#define LCD_RD_WF8B_BPGLCD58(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD58_MASK) >> LCD_WF8B_BPGLCD58_SHIFT)
#define LCD_BRD_WF8B_BPGLCD58(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD58_SHIFT))

/*! @brief Set the BPGLCD58 field to a new value. */
#define LCD_WR_WF8B_BPGLCD58(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD58_MASK, LCD_WF8B_BPGLCD58(value)))
#define LCD_BWR_WF8B_BPGLCD58(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD58_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD0[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD0 field. */
#define LCD_RD_WF8B_BPGLCD0(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD0_MASK) >> LCD_WF8B_BPGLCD0_SHIFT)
#define LCD_BRD_WF8B_BPGLCD0(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD0_SHIFT))

