RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*! @brief Set the BPGLCD50 field to a new value. */
#define LCD_WR_WF8B_BPGLCD50(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD50_MASK, LCD_WF8B_BPGLCD50(value)))
#define LCD_BWR_WF8B_BPGLCD50(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD50_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD18[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD18 field. */
#define LCD_RD_WF8B_BPGLCD18(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD18_MASK) >> LCD_WF8B_BPGLCD18_SHIFT)
#define LCD_BRD_WF8B_BPGLCD18(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD18_SHIFT))

/*! @brief Set the BPGLCD18 field to a new value. */
#define LCD_WR_WF8B_BPGLCD18(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD18_MASK, LCD_WF8B_BPGLCD18(value)))
#define LCD_BWR_WF8B_BPGLCD18(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD18_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD19[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD19 field. */
#define LCD_RD_WF8B_BPGLCD19(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD19_MASK) >> LCD_WF8B_BPGLCD19_SHIFT)
#define LCD_BRD_WF8B_BPGLCD19(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD19_SHIFT))

/*! @brief Set the BPGLCD19 field to a new value. */
#define LCD_WR_WF8B_BPGLCD19(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD19_MASK, LCD_WF8B_BPGLCD19(value)))
#define LCD_BWR_WF8B_BPGLCD19(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD19_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD8[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD8 field. */
#define LCD_RD_WF8B_BPGLCD8(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD8_MASK) >> LCD_WF8B_BPGLCD8_SHIFT)
#define LCD_BRD_WF8B_BPGLCD8(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD8_SHIFT))

/*! @brief Set the BPGLCD8 field to a new value. */
#define LCD_WR_WF8B_BPGLCD8(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD8_MASK, LCD_WF8B_BPGLCD8(value)))
#define LCD_BWR_WF8B_BPGLCD8(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD8_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD49[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD49 field. */
#define LCD_RD_WF8B_BPGLCD49(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD49_MASK) >> LCD_WF8B_BPGLCD49_SHIFT)
#define LCD_BRD_WF8B_BPGLCD49(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD49_SHIFT))

/*! @brief Set the BPGLCD49 field to a new value. */
#define LCD_WR_WF8B_BPGLCD49(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD49_MASK, LCD_WF8B_BPGLCD49(value)))
#define LCD_BWR_WF8B_BPGLCD49(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD49_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD20[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD20 field. */
#define LCD_RD_WF8B_BPGLCD20(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD20_MASK) >> LCD_WF8B_BPGLCD20_SHIFT)
#define LCD_BRD_WF8B_BPGLCD20(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD20_SHIFT))

/*! @brief Set the BPGLCD20 field to a new value. */
#define LCD_WR_WF8B_BPGLCD20(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD20_MASK, LCD_WF8B_BPGLCD20(value)))
#define LCD_BWR_WF8B_BPGLCD20(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD20_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD9[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD9 field. */
#define LCD_RD_WF8B_BPGLCD9(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD9_MASK) >> LCD_WF8B_BPGLCD9_SHIFT)
#define LCD_BRD_WF8B_BPGLCD9(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD9_SHIFT))

/*! @brief Set the BPGLCD9 field to a new value. */
#define LCD_WR_WF8B_BPGLCD9(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD9_MASK, LCD_WF8B_BPGLCD9(value)))
#define LCD_BWR_WF8B_BPGLCD9(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD9_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD21[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD21 field. */
#define LCD_RD_WF8B_BPGLCD21(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD21_MASK) >> LCD_WF8B_BPGLCD21_SHIFT)
#define LCD_BRD_WF8B_BPGLCD21(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD21_SHIFT))

/*! @brief Set the BPGLCD21 field to a new value. */
#define LCD_WR_WF8B_BPGLCD21(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD21_MASK, LCD_WF8B_BPGLCD21(value)))
#define LCD_BWR_WF8B_BPGLCD21(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD21_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD13[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD13 field. */
#define LCD_RD_WF8B_BPGLCD13(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD13_MASK) >> LCD_WF8B_BPGLCD13_SHIFT)
#define LCD_BRD_WF8B_BPGLCD13(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD13_SHIFT))

/*! @brief Set the BPGLCD13 field to a new value. */
#define LCD_WR_WF8B_BPGLCD13(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD13_MASK, LCD_WF8B_BPGLCD13(value)))
#define LCD_BWR_WF8B_BPGLCD13(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD13_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD48[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD48 field. */
#define LCD_RD_WF8B_BPGLCD48(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD48_MASK) >> LCD_WF8B_BPGLCD48_SHIFT)
#define LCD_BRD_WF8B_BPGLCD48(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD48_SHIFT))

/*! @brief Set the BPGLCD48 field to a new value. */
#define LCD_WR_WF8B_BPGLCD48(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD48_MASK, LCD_WF8B_BPGLCD48(value)))
#define LCD_BWR_WF8B_BPGLCD48(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD48_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD22[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD22 field. */
#define LCD_RD_WF8B_BPGLCD22(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD22_MASK) >> LCD_WF8B_BPGLCD22_SHIFT)
#define LCD_BRD_WF8B_BPGLCD22(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD22_SHIFT))

/*! @brief Set the BPGLCD22 field to a new value. */
#define LCD_WR_WF8B_BPGLCD22(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD22_MASK, LCD_WF8B_BPGLCD22(value)))
#define LCD_BWR_WF8B_BPGLCD22(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD22_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD5[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD5 field. */
#define LCD_RD_WF8B_BPGLCD5(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD5_MASK) >> LCD_WF8B_BPGLCD5_SHIFT)
#define LCD_BRD_WF8B_BPGLCD5(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD5_SHIFT))

/*! @brief Set the BPGLCD5 field to a new value. */
#define LCD_WR_WF8B_BPGLCD5(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD5_MASK, LCD_WF8B_BPGLCD5(value)))
#define LCD_BWR_WF8B_BPGLCD5(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD5_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD47[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD47 field. */
#define LCD_RD_WF8B_BPGLCD47(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD47_MASK) >> LCD_WF8B_BPGLCD47_SHIFT)
#define LCD_BRD_WF8B_BPGLCD47(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD47_SHIFT))

/*! @brief Set the BPGLCD47 field to a new value. */
#define LCD_WR_WF8B_BPGLCD47(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD47_MASK, LCD_WF8B_BPGLCD47(value)))
#define LCD_BWR_WF8B_BPGLCD47(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD47_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD23[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD23 field. */
#define LCD_RD_WF8B_BPGLCD23(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD23_MASK) >> LCD_WF8B_BPGLCD23_SHIFT)
#define LCD_BRD_WF8B_BPGLCD23(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD23_SHIFT))

/*! @brief Set the BPGLCD23 field to a new value. */
#define LCD_WR_WF8B_BPGLCD23(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD23_MASK, LCD_WF8B_BPGLCD23(value)))
#define LCD_BWR_WF8B_BPGLCD23(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD23_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD24[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD24 field. */
#define LCD_RD_WF8B_BPGLCD24(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD24_MASK) >> LCD_WF8B_BPGLCD24_SHIFT)
#define LCD_BRD_WF8B_BPGLCD24(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD24_SHIFT))

