RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*! @brief Set the BPGLCD3 field to a new value. */
#define LCD_WR_WF8B_BPGLCD3(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD3_MASK, LCD_WF8B_BPGLCD3(value)))
#define LCD_BWR_WF8B_BPGLCD3(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD37[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD37 field. */
#define LCD_RD_WF8B_BPGLCD37(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD37_MASK) >> LCD_WF8B_BPGLCD37_SHIFT)
#define LCD_BRD_WF8B_BPGLCD37(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD37_SHIFT))

/*! @brief Set the BPGLCD37 field to a new value. */
#define LCD_WR_WF8B_BPGLCD37(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD37_MASK, LCD_WF8B_BPGLCD37(value)))
#define LCD_BWR_WF8B_BPGLCD37(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD37_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD40[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD40 field. */
#define LCD_RD_WF8B_BPGLCD40(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD40_MASK) >> LCD_WF8B_BPGLCD40_SHIFT)
#define LCD_BRD_WF8B_BPGLCD40(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD40_SHIFT))

/*! @brief Set the BPGLCD40 field to a new value. */
#define LCD_WR_WF8B_BPGLCD40(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD40_MASK, LCD_WF8B_BPGLCD40(value)))
#define LCD_BWR_WF8B_BPGLCD40(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD40_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD38[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD38 field. */
#define LCD_RD_WF8B_BPGLCD38(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD38_MASK) >> LCD_WF8B_BPGLCD38_SHIFT)
#define LCD_BRD_WF8B_BPGLCD38(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD38_SHIFT))

/*! @brief Set the BPGLCD38 field to a new value. */
#define LCD_WR_WF8B_BPGLCD38(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD38_MASK, LCD_WF8B_BPGLCD38(value)))
#define LCD_BWR_WF8B_BPGLCD38(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD38_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPGLCD39[6] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase G
 * - 0b1 - LCD segment on or LCD backplane active for phase G
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPGLCD39 field. */
#define LCD_RD_WF8B_BPGLCD39(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPGLCD39_MASK) >> LCD_WF8B_BPGLCD39_SHIFT)
#define LCD_BRD_WF8B_BPGLCD39(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD39_SHIFT))

/*! @brief Set the BPGLCD39 field to a new value. */
#define LCD_WR_WF8B_BPGLCD39(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPGLCD39_MASK, LCD_WF8B_BPGLCD39(value)))
#define LCD_BWR_WF8B_BPGLCD39(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPGLCD39_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD63[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD63 field. */
#define LCD_RD_WF8B_BPHLCD63(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD63_MASK) >> LCD_WF8B_BPHLCD63_SHIFT)
#define LCD_BRD_WF8B_BPHLCD63(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD63_SHIFT))

/*! @brief Set the BPHLCD63 field to a new value. */
#define LCD_WR_WF8B_BPHLCD63(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD63_MASK, LCD_WF8B_BPHLCD63(value)))
#define LCD_BWR_WF8B_BPHLCD63(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD63_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD62[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD62 field. */
#define LCD_RD_WF8B_BPHLCD62(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD62_MASK) >> LCD_WF8B_BPHLCD62_SHIFT)
#define LCD_BRD_WF8B_BPHLCD62(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD62_SHIFT))

/*! @brief Set the BPHLCD62 field to a new value. */
#define LCD_WR_WF8B_BPHLCD62(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD62_MASK, LCD_WF8B_BPHLCD62(value)))
#define LCD_BWR_WF8B_BPHLCD62(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD62_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD61[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD61 field. */
#define LCD_RD_WF8B_BPHLCD61(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD61_MASK) >> LCD_WF8B_BPHLCD61_SHIFT)
#define LCD_BRD_WF8B_BPHLCD61(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD61_SHIFT))

/*! @brief Set the BPHLCD61 field to a new value. */
#define LCD_WR_WF8B_BPHLCD61(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD61_MASK, LCD_WF8B_BPHLCD61(value)))
#define LCD_BWR_WF8B_BPHLCD61(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD61_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD60[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD60 field. */
#define LCD_RD_WF8B_BPHLCD60(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD60_MASK) >> LCD_WF8B_BPHLCD60_SHIFT)
#define LCD_BRD_WF8B_BPHLCD60(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD60_SHIFT))

