RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*
 * Constants & macros for individual TSI_PEN bitfields
 */

/*!
 * @name Register TSI_PEN, field PEN0[0] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN0 field. */
#define TSI_RD_PEN_PEN0(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN0_MASK) >> TSI_PEN_PEN0_SHIFT)
#define TSI_BRD_PEN_PEN0(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN0_SHIFT))

/*! @brief Set the PEN0 field to a new value. */
#define TSI_WR_PEN_PEN0(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN0_MASK, TSI_PEN_PEN0(value)))
#define TSI_BWR_PEN_PEN0(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN1[1] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN1 field. */
#define TSI_RD_PEN_PEN1(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN1_MASK) >> TSI_PEN_PEN1_SHIFT)
#define TSI_BRD_PEN_PEN1(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN1_SHIFT))

/*! @brief Set the PEN1 field to a new value. */
#define TSI_WR_PEN_PEN1(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN1_MASK, TSI_PEN_PEN1(value)))
#define TSI_BWR_PEN_PEN1(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN2[2] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN2 field. */
#define TSI_RD_PEN_PEN2(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN2_MASK) >> TSI_PEN_PEN2_SHIFT)
#define TSI_BRD_PEN_PEN2(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN2_SHIFT))

/*! @brief Set the PEN2 field to a new value. */
#define TSI_WR_PEN_PEN2(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN2_MASK, TSI_PEN_PEN2(value)))
#define TSI_BWR_PEN_PEN2(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN3[3] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN3 field. */
#define TSI_RD_PEN_PEN3(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN3_MASK) >> TSI_PEN_PEN3_SHIFT)
#define TSI_BRD_PEN_PEN3(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN3_SHIFT))

/*! @brief Set the PEN3 field to a new value. */
#define TSI_WR_PEN_PEN3(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN3_MASK, TSI_PEN_PEN3(value)))
#define TSI_BWR_PEN_PEN3(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN4[4] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN4 field. */
#define TSI_RD_PEN_PEN4(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN4_MASK) >> TSI_PEN_PEN4_SHIFT)
#define TSI_BRD_PEN_PEN4(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN4_SHIFT))

/*! @brief Set the PEN4 field to a new value. */
#define TSI_WR_PEN_PEN4(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN4_MASK, TSI_PEN_PEN4(value)))
#define TSI_BWR_PEN_PEN4(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN4_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN5[5] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN5 field. */
#define TSI_RD_PEN_PEN5(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN5_MASK) >> TSI_PEN_PEN5_SHIFT)
#define TSI_BRD_PEN_PEN5(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN5_SHIFT))

/*! @brief Set the PEN5 field to a new value. */
#define TSI_WR_PEN_PEN5(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN5_MASK, TSI_PEN_PEN5(value)))
#define TSI_BWR_PEN_PEN5(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN5_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN6[6] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN6 field. */
#define TSI_RD_PEN_PEN6(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN6_MASK) >> TSI_PEN_PEN6_SHIFT)
#define TSI_BRD_PEN_PEN6(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN6_SHIFT))

/*! @brief Set the PEN6 field to a new value. */
#define TSI_WR_PEN_PEN6(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN6_MASK, TSI_PEN_PEN6(value)))
#define TSI_BWR_PEN_PEN6(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN6_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN7[7] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN7 field. */
#define TSI_RD_PEN_PEN7(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN7_MASK) >> TSI_PEN_PEN7_SHIFT)
#define TSI_BRD_PEN_PEN7(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN7_SHIFT))

/*! @brief Set the PEN7 field to a new value. */
#define TSI_WR_PEN_PEN7(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN7_MASK, TSI_PEN_PEN7(value)))
#define TSI_BWR_PEN_PEN7(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN7_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN8[8] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN8 field. */
#define TSI_RD_PEN_PEN8(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN8_MASK) >> TSI_PEN_PEN8_SHIFT)
#define TSI_BRD_PEN_PEN8(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN8_SHIFT))

/*! @brief Set the PEN8 field to a new value. */
#define TSI_WR_PEN_PEN8(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN8_MASK, TSI_PEN_PEN8(value)))
#define TSI_BWR_PEN_PEN8(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN8_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN9[9] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN9 field. */
#define TSI_RD_PEN_PEN9(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN9_MASK) >> TSI_PEN_PEN9_SHIFT)
#define TSI_BRD_PEN_PEN9(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN9_SHIFT))

/*! @brief Set the PEN9 field to a new value. */
#define TSI_WR_PEN_PEN9(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN9_MASK, TSI_PEN_PEN9(value)))
#define TSI_BWR_PEN_PEN9(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN9_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN10[10] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN10 field. */
#define TSI_RD_PEN_PEN10(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN10_MASK) >> TSI_PEN_PEN10_SHIFT)
#define TSI_BRD_PEN_PEN10(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN10_SHIFT))

/*! @brief Set the PEN10 field to a new value. */
#define TSI_WR_PEN_PEN10(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN10_MASK, TSI_PEN_PEN10(value)))
#define TSI_BWR_PEN_PEN10(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN10_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN11[11] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN11 field. */
#define TSI_RD_PEN_PEN11(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN11_MASK) >> TSI_PEN_PEN11_SHIFT)
#define TSI_BRD_PEN_PEN11(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN11_SHIFT))

