RT-Thread/rt-thread/bsp/freescale/platform/devices/MK30D10/include/MK30D10_extension.h
/*
 * Constants & macros for individual UART_C6 bitfields
 */

/*!
 * @name Register UART_C6, field CP[4] (RW)
 *
 * Indicates the polarity of the collision signal.
 *
 * Values:
 * - 0b0 - Collision signal is active low.
 * - 0b1 - Collision signal is active high.
 */
/*@{*/
/*! @brief Read current value of the UART_C6_CP field. */
#define UART_RD_C6_CP(base)  ((UART_C6_REG(base) & UART_C6_CP_MASK) >> UART_C6_CP_SHIFT)
#define UART_BRD_C6_CP(base) (BITBAND_ACCESS8(&UART_C6_REG(base), UART_C6_CP_SHIFT))

/*! @brief Set the CP field to a new value. */
#define UART_WR_C6_CP(base, value) (UART_RMW_C6(base, UART_C6_CP_MASK, UART_C6_CP(value)))
#define UART_BWR_C6_CP(base, value) (BITBAND_ACCESS8(&UART_C6_REG(base), UART_C6_CP_SHIFT) = (value))
/*@}*/

/*!
 * @name Register UART_C6, field CE[5] (RW)
 *
 * Enables the collision detect functionality.
 *
 * Values:
 * - 0b0 - Collision detect feature is disabled.
 * - 0b1 - Collision detect feature is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_C6_CE field. */
#define UART_RD_C6_CE(base)  ((UART_C6_REG(base) & UART_C6_CE_MASK) >> UART_C6_CE_SHIFT)
#define UART_BRD_C6_CE(base) (BITBAND_ACCESS8(&UART_C6_REG(base), UART_C6_CE_SHIFT))

/*! @brief Set the CE field to a new value. */
#define UART_WR_C6_CE(base, value) (UART_RMW_C6(base, UART_C6_CE_MASK, UART_C6_CE(value)))
#define UART_BWR_C6_CE(base, value) (BITBAND_ACCESS8(&UART_C6_REG(base), UART_C6_CE_SHIFT) = (value))
/*@}*/

/*!
 * @name Register UART_C6, field TX709[6] (RW)
 *
 * Starts CEA709.1-B transmission.
 *
 * Values:
 * - 0b0 - CEA709.1-B transmitter is disabled.
 * - 0b1 - CEA709.1-B transmitter is enabled.
 */
/*@{*/
/*! @brief Read current value of the UART_C6_TX709 field. */
#define UART_RD_C6_TX709(base) ((UART_C6_REG(base) & UART_C6_TX709_MASK) >> UART_C6_TX709_SHIFT)
#define UART_BRD_C6_TX709(base) (BITBAND_ACCESS8(&UART_C6_REG(base), UART_C6_TX709_SHIFT))

/*! @brief Set the TX709 field to a new value. */
#define UART_WR_C6_TX709(base, value) (UART_RMW_C6(base, UART_C6_TX709_MASK, UART_C6_TX709(value)))
#define UART_BWR_C6_TX709(base, value) (BITBAND_ACCESS8(&UART_C6_REG(base), UART_C6_TX709_SHIFT) = (value))
/*@}*/

/*!
 * @name Register UART_C6, field EN709[7] (RW)
 *
 * Enables the CEA709.1-B feature.
 *
 * Values:
 * - 0b0 - CEA709.1-B is disabled.
 * - 0b1 - CEA709.1-B is enabled
 */
/*@{*/
/*! @brief Read current value of the UART_C6_EN709 field. */
#define UART_RD_C6_EN709(base) ((UART_C6_REG(base) & UART_C6_EN709_MASK) >> UART_C6_EN709_SHIFT)
#define UART_BRD_C6_EN709(base) (BITBAND_ACCESS8(&UART_C6_REG(base), UART_C6_EN709_SHIFT))

/*! @brief Set the EN709 field to a new value. */
#define UART_WR_C6_EN709(base, value) (UART_RMW_C6(base, UART_C6_EN709_MASK, UART_C6_EN709(value)))
#define UART_BWR_C6_EN709(base, value) (BITBAND_ACCESS8(&UART_C6_REG(base), UART_C6_EN709_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * UART_PCTH - UART CEA709.1-B Packet Cycle Time Counter High
 ******************************************************************************/

/*!
 * @brief UART_PCTH - UART CEA709.1-B Packet Cycle Time Counter High (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_PCTH register
 */
/*@{*/
#define UART_RD_PCTH(base)       (UART_PCTH_REG(base))
#define UART_WR_PCTH(base, value) (UART_PCTH_REG(base) = (value))
#define UART_RMW_PCTH(base, mask, value) (UART_WR_PCTH(base, (UART_RD_PCTH(base) & ~(mask)) | (value)))
#define UART_SET_PCTH(base, value) (UART_WR_PCTH(base, UART_RD_PCTH(base) |  (value)))
#define UART_CLR_PCTH(base, value) (UART_WR_PCTH(base, UART_RD_PCTH(base) & ~(value)))
#define UART_TOG_PCTH(base, value) (UART_WR_PCTH(base, UART_RD_PCTH(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * UART_PCTL - UART CEA709.1-B Packet Cycle Time Counter Low
 ******************************************************************************/

/*!
 * @brief UART_PCTL - UART CEA709.1-B Packet Cycle Time Counter Low (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_PCTL register
 */
/*@{*/
#define UART_RD_PCTL(base)       (UART_PCTL_REG(base))
#define UART_WR_PCTL(base, value) (UART_PCTL_REG(base) = (value))
#define UART_RMW_PCTL(base, mask, value) (UART_WR_PCTL(base, (UART_RD_PCTL(base) & ~(mask)) | (value)))
#define UART_SET_PCTL(base, value) (UART_WR_PCTL(base, UART_RD_PCTL(base) |  (value)))
#define UART_CLR_PCTL(base, value) (UART_WR_PCTL(base, UART_RD_PCTL(base) & ~(value)))
#define UART_TOG_PCTL(base, value) (UART_WR_PCTL(base, UART_RD_PCTL(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * UART_B1T - UART CEA709.1-B Beta1 Timer
 ******************************************************************************/

/*!
 * @brief UART_B1T - UART CEA709.1-B Beta1 Timer (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_B1T register
 */
/*@{*/
#define UART_RD_B1T(base)        (UART_B1T_REG(base))
#define UART_WR_B1T(base, value) (UART_B1T_REG(base) = (value))
#define UART_RMW_B1T(base, mask, value) (UART_WR_B1T(base, (UART_RD_B1T(base) & ~(mask)) | (value)))
#define UART_SET_B1T(base, value) (UART_WR_B1T(base, UART_RD_B1T(base) |  (value)))
#define UART_CLR_B1T(base, value) (UART_WR_B1T(base, UART_RD_B1T(base) & ~(value)))
#define UART_TOG_B1T(base, value) (UART_WR_B1T(base, UART_RD_B1T(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * UART_SDTH - UART CEA709.1-B Secondary Delay Timer High
 ******************************************************************************/

/*!
 * @brief UART_SDTH - UART CEA709.1-B Secondary Delay Timer High (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire UART_SDTH register
 */
/*@{*/
#define UART_RD_SDTH(base)       (UART_SDTH_REG(base))
#define UART_WR_SDTH(base, value) (UART_SDTH_REG(base) = (value))
#define UART_RMW_SDTH(base, mask, value) (UART_WR_SDTH(base, (UART_RD_SDTH(base) & ~(mask)) | (value)))
#define UART_SET_SDTH(base, value) (UART_WR_SDTH(base, UART_RD_SDTH(base) |  (value)))
#define UART_CLR_SDTH(base, value) (UART_WR_SDTH(base, UART_RD_SDTH(base) & ~(value)))
#define UART_TOG_SDTH(base, value) (UART_WR_SDTH(base, UART_RD_SDTH(base) ^  (value)))
/*@}*/

